app/Controllers/Emprestimo.php

    public function index(){
        $emprestimo = $this->EmprestimoModel->findAll();
        $livro = $this->livroModel->findAll();
        $dadosobra = $this->obraModel->findAll();
        $aluno = $this->alunoModel->findAll();
        $usuario = $this->usuarioModel->findAll();
---
SELECT *
FROM `emprestimo`
SELECT *
FROM `livro`
SELECT *
FROM `obra`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`

    public function cadastrar()
    {
        $dados = $this->request->getPost();
        $this->EmprestimoModel->save($dados);
        $this->livroModel->update($dados['id_livro'], ['disponivel' => 0]);
---
INSERT INTO `emprestimo` (`data_inicio`, `id_livro`, `id_usuario`, `id_aluno`) VALUES ('2024-06-21', '20', '2', '3')
UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('20')

    public function salvar(){
        $dados = $this->request->getPost();
        $this->EmprestimoModel->save($dados);
        $this->livroModel->update($dados['id_livro'], ['disponivel' => 0]);
---
UPDATE `emprestimo` SET `data_fim` = '', `id_livro` = '20'
WHERE `emprestimo`.`id` IN ('18')
UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('20')

    public function devolucao($id){
        $emprestimo = $this->EmprestimoModel->find($id);
        $dadosobra = $this->obraModel->findAll();
        $livro = $this->livroModel->findAll();
---
SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '18'
SELECT *
FROM `obra`
SELECT *
FROM `livro`